BUILD/doc/source/_static/soap_outputs/6.5.314.4301/create_question_from_json_step_4_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <question>
          <hidden_flag>0</hidden_flag>
          <skip_lock_flag>0</skip_lock_flag>
          <query_text>Get Action Statuses matching "Nil" from all machines</query_text>
          <expire_seconds>0</expire_seconds>
          <force_computer_id_flag>1</force_computer_id_flag>
          <action_tracking_flag>0</action_tracking_flag>
          <expiration>2015-09-14T13:48:06</expiration>
          <context_group>
            <id>0</id>
          </context_group>
          <user>
            <name>Administrator</name>
            <id>1</id>
          </user>
          <management_rights_group>
            <id>0</id>
          </management_rights_group>
          <selects>
            <select>
              <filter>
                <substring_length>0</substring_length>
                <end_time>2001-01-01T00:00:00</end_time>
                <not_flag>0</not_flag>
                <all_times_flag>0</all_times_flag>
                <start_time>2001-01-01T00:00:00</start_time>
                <value>Nil</value>
                <ignore_case_flag>1</ignore_case_flag>
                <max_age_seconds>0</max_age_seconds>
                <value_type>String</value_type>
                <delimiter_index>0</delimiter_index>
                <utf8_flag>0</utf8_flag>
                <operator>RegexMatch</operator>
                <all_values_flag>1</all_values_flag>
                <substring_flag>0</substring_flag>
                <substring_start>0</substring_start>
              </filter>
              <sensor>
                <category>Reserved</category>
                <hash>1792443391</hash>
                <name>Action Statuses</name>
                <hidden_flag>0</hidden_flag>
                <exclude_from_parse_flag>1</exclude_from_parse_flag>
                <string_count>110</string_count>
                <ignore_case_flag>1</ignore_case_flag>
                <max_age_seconds>3600</max_age_seconds>
                <value_type>String</value_type>
                <source_id>0</source_id>
                <id>1</id>
                <description>The recorded state of each action a client has taken recently in the form of id:status.
Example: 1:Completed</description>
                <queries>
                  <query>
                    <platform>Windows</platform>
                    <script_type>WMIQuery</script_type>
                    <script>Reserved</script>
                  </query>
                </queries>
              </sensor>
            </select>
          </selects>
          <saved_question>
            <id>0</id>
          </saved_question>
        </question>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>